//利润<=10w，奖金可提10%
// 10<利润<=20w，低于1ow的部分可提10%，高于10w部分可提7.5%
//20<利润<=40w，高于20w部分可提5%
//（40,60） ,3%
//(60,100) ,1.5%
//>100   ,1%
//从键盘输入当月利润i，求应发放奖金总数 
#include<stdio.h>

int main()
{
	double i,bonus=0;
	scanf("%lf",&i);
	if(i<=100000){
		bonus = 0.1*i;
	} else if(i<=200000){
		bonus = 10000+(i-100000)*0.075;
	} else if(i<=400000){
		bonus = 10000+7500+(i-200000)*0.05;
	} else if(i<=600000){
		bonus = 10000+7500+10000+(i-400000)*0.03;
	} else if(i<=1000000){
		bonus = 10000+7500+10000+6000+(i-600000)*0.015;
	} else if(i>1000000){
		bonus = 10000+7500+10000+6000+6000+(i-1000000)*0.01;
	}
	printf("利润为%f\n",bonus);
	return 0;
}
